# tap all the normal stuff

tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"

# terminal and text editor
cask "iterm2"
brew "nvim"
cask "zed"

# things to install things
brew "cask"
brew "wget"

# pairing
brew "tmate"
cask "tuple"

# enterprise business value
cask "spotify"
cask "slack"

# make the computer computer more good
cask "rectangle"
cask "flycut"

# good tools to have on the command line
brew "bat"
brew "direnv"
brew "fswatch"
brew "jq"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "watch"
brew "z"

# sometimes you just want to run a load test you know?
brew "hey"

# some apps I like to have around
cask "freedom"
cask "telegram"
cask "anki"
cask "superhuman"

# for Zero development
brew "flyctl"
brew "ctags"

# for Nvim plugins
brew "ripgrep"

# for spiking for card_rater
cask "livebook"
