# tap all the normal stuff
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# terminal and text editor
cask "iterm2"
brew "nvim"

# things to install things
brew "cask"
brew "asdf"
brew "wget"

# pairing
brew "tmate"

# make the computer computer more good with a window manager
cask "rectangle"

# good tools to have on the command line
brew "direnv"
brew "fswatch"
brew "jq"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "watch"
brew "z"

# sometimes you just want to run a load test you know?
brew "hey"

# some apps I like to have around
cask "freedom"
cask "telegram"
cask "anki"

# Need a Postgres for most app dev work
brew "postgresql", restart_service: true
brew "postgresql@13"

# for Zero development
brew "flyctl"
brew "ctags"

# for Nvim plugins
brew "ripgrep"
brew "lua-language-server"

# for Concourse work
tap "engineerbetter/homebrew-tap"
brew "engineerbetter/tap/control-tower"
tap "cloudfoundry/tap"
brew "cloudfoundry/tap/bosh-cli"
brew "terraform"

# for Magic
tap "rconroy293/seventeenlands"
brew "rconroy293/seventeenlands/seventeenlands", restart_service: true
