# tap all the normal stuff
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# for the aws cli
tap "aws/tap"

# install hashicorp terraform
tap "hashicorp/tap"
brew "terraform"

# terminal and text editor
cask "iterm2"
brew "nvim"

# things to install things
brew "cask"
brew "asdf"
brew "wget"

# good tools to have on the command line
brew "direnv"
brew "fswatch"
brew "jq"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "watch"
brew "z"

# sometimes you just want to run a load test you know?
brew "hey"

# some apps I like to have around
cask "freedom"
cask "telegram"

# I usually like to have Ruby around
# chruby is my Ruby manager of choice
# I should maybe switch to asdf though
brew "chruby"
brew "ruby-install"

# Need a Postgres for most app dev work
brew "postgresql", restart_service: true
brew "postgresql@13"

# project specific tools
brew "aws/tap/lightsailctl"
brew "awscli"
brew "eslint"
brew "prettier"
cask "visual-studio-code"
